package Semseter2.Workshop.practice1;
    import java.awt.*; // ייבוא מחלקות ממשק משתמש גרפי (GUI) של Java
    public class Player { // הכרזה על מחלקה ציבורית בשם Player
        private int x; // משתנה פרטי מסוג int לייצוג קואורדינטת X של השחקן
        private int y; // משתנה פרטי מסוג int לייצוג קואורדינטת Y של השחקן
        // בנאי (Constructor) של המחלקה Player
        // מופעל כאשר יוצרים אובייקט חדש מסוג Player
        public Player(int x, int y) {
            this.x = x; // אתחול קואורדינטת X של האובייקט בערך שהתקבל כארגומנט
            this.y = y; // אתחול קואורדינטת Y של האובייקט בערך שהתקבל כארגומנט
        } // מתודה ציבורית ללא החזרה (void) בשם moveUp
        // שמטרתה להזיז את השחקן למעלה
        public void moveUp() {
            this.y--; // הקטנת ערך קואורדינטת Y ב-1, מה שמזיז את השחקן למעלה במערכת קואורדינטות גרפית סטנדרטית
        }
        // מתודה ציבורית ללא החזרה (void) בשם moveDown
        // שמטרתה להזיז את השחקן למטה
        public void moveDown() {
            this.y++; // הגדלת ערך קואורדינטת Y ב-1, מה שמזיז את השחקן למטה במערכת קואורדינטות גרפית סטנדרטית
        }
        // מתודה ציבורית ללא החזרה (void) בשם paint


        public void paint(Graphics graphics) { // מתודה ציבורית ללא החזרה (void) בשם paint המקבלת אובייקט Graphics
            graphics.setColor(Color.GREEN); // הגדרת צבע הציור לירוק
            graphics.fillOval(this.x, this.y, 50, 50); // ציור אליפסה מלאה (עיגול במקרה הזה) במיקום (x, y) ובגודל 50x50
        }


        // מתודה ציבורית המחזירה ערך מסוג int בשם getX
        // מתודה זו משמשת לקבלת הערך של משתנה ה-x של האובייקט
        public int getX() {
            return x; // החזרת הערך של משתנה ה-x
        }

        // מתודה ציבורית ללא החזרה (void) בשם setX המקבלת ארגומנט מסוג int בשם x
        // מתודה זו משמשת לעדכון הערך של משתנה ה-x של האובייקט
        public void setX(int x) {
            this.x = x; // עדכון משתנה ה-x של האובייקט בערך שהתקבל כארגומנט
        }

        // מתודה ציבורית המחזירה ערך מסוג int בשם getY
        // מתודה זו משמשת לקבלת הערך של משתנה ה-y של האובייקט
        public int getY() {
            return y; // החזרת הערך של משתנה ה-y
        }

        // מתודה ציבורית ללא החזרה (void) בשם setY המקבלת ארגומנט מסוג int בשם y
        // מתודה זו משמשת לעדכון הערך של משתנה ה-y של האובייקט
        public void setY(int y) {
            this.y = y; // עדכון משתנה ה-y של האובייקט בערך שהתקבל כארגומנט
        }
    }

